Backward_Facing_Step/Compressible_Turbulence_Pimple/constant/momentumTransport
FoamFile
{
    format      ascii;
    class       dictionary;
    object      momentumTransport;
}

simulationType RAS;

RAS
{
   	model               kEpsilon;

   	turbulence          on;

	viscosityModel	    Newtonian;
}
