Backward_Facing_Step/Compressible_Turbulence_Pimple/0/U
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (651.9 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    upperWall
    {
        type            slip;
    }
    lowerWall
    {
        type            noSlip;
    }
    frontAndBack
    {
        type            empty;
    }
}
