Backward_Facing_Step/Compressible_Turbulence_Pimple/0/p
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1.3449e4;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 1.535e4;
    }
    outlet
    {
        type            zeroGradient;
    }
    upperWall
    {
        type            zeroGradient;
    }
    lowerWall
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}
