Backward_Facing_Step/Compressible_Turbulence_Pimple/0/T
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 153.2; // for consistence

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 169.2;
    }
    outlet
    {
        type            zeroGradient;
    }
    upperWall
    {
        type            zeroGradient;
    }
    lowerWall
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}
