Backward_Facing_Step/Compressible_Turbulence_Pimple/0/alphat
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }

    outlet
    {
        type            calculated;
        value           uniform 0;
    }

    upperWall
    {
		type			compressible::alphatWallFunction;
		value			uniform 0;
    }

	lowerWall
    {
		type			compressible::alphatWallFunction; // compressible heat
		value			uniform 0;
    }

	frontAndBack
	{
		type			empty;
	}
}
