Backward_Facing_Step/Compressible_Turbulence_Pimple/0/epsilon
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 14.855; // to be adjusted

boundaryField
{
    inlet
    {
		type            fixedValue;   // supplies inlet dissipation
        value           uniform 14.855;
    }
    outlet
    {
        type            zeroGradient;
    }
    upperWall
    {
		type            epsilonWallFunction; // boundary treatment
        value           uniform 14.855;
    }
    lowerWall
    {
		type            epsilonWallFunction; // boundary treatment
        value           uniform 14.855;
    }
    frontAndBack
    {
        type            empty;
    }
}
