Backward_Facing_Step/Compressible_Turbulence_Pimple/0/nut
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      nut;
}

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0; // turbulent kinematic viscosity

boundaryField
{
    inlet
    {
        type            calculated;
		value			uniform 0;
    }

    outlet
    {
        type            calculated;
		value			uniform 0;
    }

    upperWall
    {
        type            nutkWallFunction;
		value			uniform 0;
    }

    lowerWall
    {
        type            nutkWallFunction;
		value			uniform 0;
    }

    frontAndBack
    {
        type            empty;
    }
}
