Backward_Facing_Step/Compressible_Turbulence_Pimple/0/rho
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   uniform 0.30617;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0.315989;
    }
    outlet
    {
        type            calculated;
        value           uniform 0.30617; // for consistence
    }
    upperWall
    {
        type            zeroGradient;
    }
    lowerWall
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}
