Backward_Facing_Step/Compressible_Turbulence_Pimple/system/fvSchemes
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}

ddtSchemes
{
    default         localEuler; 
}

gradSchemes
{
    default         cellMDLimited Gauss linear 1;
    grad(p)         cellMDLimited Gauss linear 0.333;
    grad(e)         cellMDLimited Gauss linear 0.333;
}

divSchemes
{
    default         none;

    div(phi,U)      Gauss upwind; 
    div(phi,e)      Gauss upwind;

    div(phi,K)          Gauss upwind;
    div(phi,k)          Gauss upwind;
    div(phi,epsilon)    Gauss upwind;
	div(phi,(p|rho))    Gauss limitedLinear 1;
	div(phid,p)			Gauss limitedLinear 1;

    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear limited 1;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         limited 1;
}

wallDist
{
    method meshWave;
}
