Backward_Facing_Step/Compressible_Turbulence_Pimple/system/fvSolution
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}

solvers
{
	p
	{
		solver			PBiCGStab;
		preconditioner	DILU;
		tolerance		1e-08;
		relTol			0.01;
	}

	pFinal
	{
		$p;
		relTol			0;
	}

    "(U.*|k.*|epsilon.*|e.*)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0;
    }

    "rho.*"
    {
        solver          diagonal;
    }
}

PIMPLE
{
	momentumPredictor		 yes;

    nOuterCorrectors		 2;
    nCorrectors				 2;
    nNonOrthogonalCorrectors 0;

    transonic				yes;

	maxCo					0.5;
	rDeltaTSmoothingCoeff	0.1;
	rDeltaTDampingCoeff		0.9;
	maxDeltaT				1;
}

relaxationFactors
{
	equations
	{
		"U.*"           0.5;
        "e.*"           0.5;
        "k.*"           0.5;
        "epsilon.*"     0.5;
	}
	fields
    {
        p               0.3;
        rho             0.1; 
    }
}
