Backward_Facing_Step/Compressible_Turbulence_Pimple/system/setFieldsDict
FoamFile
{
	format		ascii;
	class		dictionary;
	location	"system";
	object		setFieldsDict;
}

regions
(
	// left of the step
    boxToCell
    {
        box (-101.6 0 -0.5) (0 147.5 0.5);

        fieldValues
        (
            volScalarFieldValue p 1.344899e4      
            volScalarFieldValue T 169.2         
            volVectorFieldValue U (651.9 0 0)    
        );
    }

	// right above the step
    boxToCell
    {
        box (0 0 -0.5) (304.8 147.5 0.5);

        fieldValues
        (
            volScalarFieldValue p 1.344899e4      
            volScalarFieldValue T 153         
            volVectorFieldValue U (619.9 0 0)    
        );
    }

	// right behind the step
    boxToCell
    {
        box (0 -11.25 -0.5) (304.8 0 0.5);

        fieldValues
        (
            volScalarFieldValue p 1.344899e4      
            volScalarFieldValue T 153         
            volVectorFieldValue U (0 0 0)    
        );
    }
);
