Backward_Facing_Step/Compressible_Turbulence_Pimple/Allrun
#!/bin/sh

cd "${0%/*}" || exit 1
. "$WM_PROJECT_DIR/bin/tools/RunFunctions"

runApplication blockMesh
runApplication checkMesh -allGeometry -allTopology
runApplication setFields
runApplication foamRun
